CSI API ETABS v1
cPropPointSpring.SetLinks Method
 Sets single joint links for a named point spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLinks(
	string Name,
	int NumberLinks,
	ref string[] LinkNames,
	ref int[] LinkAxialDirs,
	ref double[] LinkAngles
)
Function SetLinks (
	Name As String,
	NumberLinks As Integer,
	ByRef LinkNames As String(),
	ByRef LinkAxialDirs As Integer(),
	ByRef LinkAngles As Double()
) As Integer
Dim instance As cPropPointSpring
Dim Name As String
Dim NumberLinks As Integer
Dim LinkNames As String()
Dim LinkAxialDirs As Integer()
Dim LinkAngles As Double()
Dim returnValue As Integer
returnValue = instance.SetLinks(Name,
	NumberLinks, LinkNames, LinkAxialDirs,
	LinkAngles)
int SetLinks(
	String^ Name,
	int NumberLinks,
	array<String^>^% LinkNames,
	array<int>^% LinkAxialDirs,
	array<double>^% LinkAngles
)
abstract SetLinks :
        Name : string *
        NumberLinks : int *
        LinkNames : string[] byref *
        LinkAxialDirs : int[] byref *
        LinkAngles : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point spring property. This spring property must be of type option 1
NumberLinks
Type: System.Int32
 The number of links
LinkNames
Type: System.String[]
 This array contains the names of existing link properties
LinkAxialDirs
Type: System.Int32[]
 This array contains integers representing the axial direction of their respective link properties and can take one of six values:
-1 : -X
-2 : -Y
-3 : -Z
1 : +X
2 : +Y
3 : +Z
LinkAngles
Type: System.Double[]
 This array contains the axis 2 angles of their respective link properties [deg]
Return Value
Type: Int32
 Returns zero if the links are successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new link property
   Dim DOF() As Boolean
   Dim Fixed() As Boolean
   Dim Ke() As Double
   Dim Ce() As Double
   ReDim DOF(5)
   ReDim Fixed(5)
   ReDim Ke(5)
   ReDim Ce(5)
   DOF(0) = True
   Ke(0) = 12
   ret = SapModel.PropLink.SetLinear("myLink1", DOF, Fixed, Ke, Ce, 0, 0)
'define new spring property
   Dim k() as Double
   ReDim k(5)
   k(2) = 1
   ret = SapModel.PropPointSpring.SetPointSpringProp("myPtSpringProp", 1, k)
'set links in spring property
   Dim NumberLinks As Integer
   Dim LinkNames() As String
   Dim LinkAxialDirs() As Integer
   Dim LinkAngles() As Double
   NumberLinks = 1
   ReDim LinkNames(NumberLinks - 1)
   ReDim LinkAxialDirs(NumberLinks - 1)
   ReDim LinkAngles(NumberLinks - 1)
   LinkNames(0) = "myLink1"
   LinkAxialDirs(0) = -2
   LinkAngles(0) = 45
   ret = SapModel.PropPointSpring.SetLinks("myPtSpringProp", NumberLinks, LinkNames, LinkAxialDirs, LinkAngles)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropPointSpring Interface
ETABSv1 Namespace